#+PROPERTY: header-args :results silent :tangle yes

** MSYS2 bash
   (hm.. git bash is better)

   By default
   - explicit-shell-file-name is nil
   - explicit-bash.exe-args .. doesn't exist
   #+BEGIN_SRC emacs-lisp
(setq explicit-shell-file-name "c:/msys64/usr/bin/bash.exe")
;; so.. --login is fucking things up. like this it's perfect :D
;; also there is the --noprofile flag. not sure if I need it
(setq explicit-bash.exe-args '("--rcfile" "~/.emacs.d/dot/.bashrc" "-i"  ))
   #+END_SRC

   #+RESULTS:
   | --rcfile | ~/.emacs.d/dot/.bashrc | -i |

   #+BEGIN_SRC emacs-lisp
(defun my-on-shell-cd-error (e)
  (message "error"))

(add-hook 'shell-set-directory-error-hook  'my-on-shell-cd-error)
   #+END_SRC

   #+RESULTS:
   | --login | -i |

** COMMENT Git bash
   #+BEGIN_SRC emacs-lisp
(setq explicit-shell-file-name "c:/Program Files/Git/bin/bash.exe")
(setq explicit-bash.exe-args '("--login" "-i"))
   #+END_SRC

   #+RESULTS:
   | --login | -i |

   From https://emacs.stackexchange.com/questions/22049/git-bash-in-emacs-on-windows

** paths: msys2
   Really useful for stuff like =ediff= etc..
   #+BEGIN_SRC emacs-lisp
(when (eq system-type 'windows-nt)
  (let (
        (mypaths
         '(
           "C:/msys64/mingw64/bin"
	   "C:/msys64/usr/local/bin"
	   "C:/msys64/usr/bin"
	   "C:/msys64/usr/bin"
	   "C:/msys64/usr/bin/site_perl"
	   "C:/msys64/usr/bin/vendor_perl"
	   "C:/msys64/usr/bin/core_perl"
           ) )
        )

    (setenv "PATH" (concat
                    (getenv "PATH")
		    ";"
		    "c:/Program Files/Chez Scheme 9.5.2/bin/ta6nt"
		    ";"
		    (mapconcat 'identity mypaths ";")
		    ))

    ;;(setq exec-path (append mypaths (list "." exec-directory)) )
    (setq exec-path (append exec-path mypaths (list exec-directory)))
    ))

   #+END_SRC

   #+RESULTS:
   | c:/Program Files/Broadcom/Broadcom 802.11 Network Adapter | C:/Python37/Scripts/ | C:/Python37/ | C:/Program Files (x86)/Common Files/Oracle/Java/javapath | C:/WINDOWS/system32 | C:/WINDOWS | C:/WINDOWS/System32/Wbem | C:/WINDOWS/System32/WindowsPowerShell/v1.0/ | C:/WINDOWS/System32/OpenSSH/ | C:/ProgramData/chocolatey/bin | c:/Program Files/Intel/WiFi/bin/ | c:/Program Files/Common Files/Intel/WirelessCommon/ | C:/Program Files/Microsoft VS Code | C:/Program Files/MiKTeX 2.9/miktex/bin/x64/ | C:/Program Files/Microsoft VS Code/bin | C:/Program Files/nodejs/ | C:/Users/actondev/AppData/Local/Android/Sdk/platform-tools/ | C:/Program Files/gnuplot/bin | C:/ProgramData/chocolatey/lib/lua53/tools | C:/Program Files/Mullvad VPN/resources | C:/tools/php74 | C:/ProgramData/ComposerSetup/bin | C:/Program Files/Git/cmd | C:/Users/actondev/.cargo/bin | C:/Users/actondev/AppData/Local/Microsoft/WindowsApps | C:/Users/actondev/bin | c:/Program Files/Intel/WiFi/bin/ | c:/Program Files/Common Files/Intel/WirelessCommon/ | C:/Users/actondev/AppData/Roaming/npm | C:/gradle/gradle-2.2/bin | C:/Users/actondev/watchman | C:/Program Files/VideoLAN/VLC | C:/Program Files/Java/jdk-11.0.5/bin | C:/Users/actondev/AppData/Roaming/Composer/vendor/bin | C:/ProgramData/chocolatey/lib/mingw/tools/install/mingw64/bin | C:/Program Files/CMake/bin | W:/dev/_sdk/sciter/bin.win/x64 | C:/Users/actondev/bin/zig-windows-x86_64-0.6.0 | . | w:/portables/emacs-27.0.50-snapshot-2019-09-18-x86_64/libexec/emacs/27.0.50/x86_64-w64-mingw32 | C:/msys64/mingw64/bin | C:/msys64/usr/local/bin | C:/msys64/usr/bin | C:/msys64/usr/bin | C:/msys64/usr/bin/site_perl | C:/msys64/usr/bin/vendor_perl | C:/msys64/usr/bin/core_perl | w:/portables/emacs-27.0.50-snapshot-2019-09-18-x86_64/libexec/emacs/27.0.50/x86_64-w64-mingw32/ | C:/msys64/mingw64/bin | C:/msys64/usr/local/bin | C:/msys64/usr/bin | C:/msys64/usr/bin | C:/msys64/usr/bin/site_perl | C:/msys64/usr/bin/vendor_perl | C:/msys64/usr/bin/core_perl | w:/portables/emacs-27.0.50-snapshot-2019-09-18-x86_64/libexec/emacs/27.0.50/x86_64-w64-mingw32/ | C:/msys64/mingw64/bin | C:/msys64/usr/local/bin | C:/msys64/usr/bin | C:/msys64/usr/bin | C:/msys64/usr/bin/site_perl | C:/msys64/usr/bin/vendor_perl | C:/msys64/usr/bin/core_perl | w:/portables/emacs-27.0.50-snapshot-2019-09-18-x86_64/libexec/emacs/27.0.50/x86_64-w64-mingw32/ | C:/msys64/mingw64/bin | C:/msys64/usr/local/bin | C:/msys64/usr/bin | C:/msys64/usr/bin | C:/msys64/usr/bin/site_perl | C:/msys64/usr/bin/vendor_perl | C:/msys64/usr/bin/core_perl | w:/portables/emacs-27.0.50-snapshot-2019-09-18-x86_64/libexec/emacs/27.0.50/x86_64-w64-mingw32/ |

** Spellcheck (flyspell & hunspell)
   See [[https://emacs.stackexchange.com/questions/14952/how-do-i-set-up-hunspell-on-a-windows-pc][this discussion]] for details. Long story short, I was getting the following error
   #+BEGIN_SRC text
Error enabling Flyspell mode:
(Can’t find Hunspell dictionary with a .aff affix file)  
   #+END_SRC

   The problem was that upon running the following code
   #+BEGIN_EXAMPLE emacs-lisp
  '(call-process ispell-program-name
	      null-device
	      t
	      nil
	      "-D"
	      "-a"
	      null-device
	      )
   #+END_EXAMPLE
   I should get at least one line with the files =.dic= and =.aff=. But it wasn't happening (yet in ubuntu yeah)

   The solution was the following

   #+BEGIN_SRC emacs-lisp
'(setenv "DICTIONARY" "en_US")
   #+END_SRC

   Add greek dictionary

   #+BEGIN_SRC emacs-lisp
(require 'ispell)
(add-to-list 'ispell-local-dictionary-alist '("el"
                                              "[[:alpha:]]"
                                              "[^[:alpha:]]"
                                              "[']"
                                              t
                                              ("-d" "el"); Dictionary file name
                                              nil
					      ;; nil
					      utf-8
                                              ;;    iso-8859-1
					      ))

(add-to-list 'ispell-local-dictionary-alist '("el,en,es"
                                              "[[:alpha:]]"
                                              "[^[:alpha:]]"
                                              "[']"
                                              t
                                              ("-d" "el"); Dictionary file name
                                              nil
					      ;; nil
					      utf-8
                                              ;;    iso-8859-1
					      ))
   #+END_SRC

   #+RESULTS:
   | el    | [[:alpha:]] | [^[:alpha:]] | ['] | t | (-d el) | nil | utf-8      |       |
   | el    | [[:alpha:]] | [^[:alpha:]] | ['] | t | nil     | nil | nil        | utf-8 |
   | greek | [[:alpha:]] | [^[:alpha:]] | ['] | t | nil     | nil | nil        | utf-8 |
   | greek | [[:alpha:]] | [^[:alpha:]] | ['] | t | (-d el) | nil | iso-8859-1 |       |

   Multiple languages
   #+BEGIN_SRC emacs-lisp
'(setq ispell-dictionary nil)
'(setq ispell-dictionary "el,en,es")
   #+END_SRC

   #+RESULTS:
   : el,en,es

* COMMENT spelling notes
  :PROPERTIES:
  :header-args: :results output replace
  :END:

  listing dictionaries
  #+BEGIN_SRC sh :results output replace
hunspell -D 2>&1
  #+END_SRC

  #+RESULTS:
  #+begin_example
  SEARCH PATH:
  .;C:/msys64/mingw64/bin/;C:/msys64/mingw64/share/hunspell;C:/msys64/mingw64/share/myspell;C:/msys64/mingw64/share/myspell/dicts;C:/msys64;%USERPROFILE%/Application Data/OpenOffice.org 2/user/wordbook;C:/msys64/mingw64/share/dict/ooo;
  AVAILABLE DICTIONARIES (path is not mandatory for -d option):
  C:/msys64/mingw64/share/hunspell/el_GR
  C:/msys64/mingw64/share/hunspell/en_AG
  C:/msys64/mingw64/share/hunspell/en_AU-large
  C:/msys64/mingw64/share/hunspell/en_AU
  C:/msys64/mingw64/share/hunspell/en_BS
  C:/msys64/mingw64/share/hunspell/en_BW
  C:/msys64/mingw64/share/hunspell/en_BZ
  C:/msys64/mingw64/share/hunspell/en_CA
  C:/msys64/mingw64/share/hunspell/en_DK
  C:/msys64/mingw64/share/hunspell/en_GB
  C:/msys64/mingw64/share/hunspell/en_GH
  C:/msys64/mingw64/share/hunspell/en_HK
  C:/msys64/mingw64/share/hunspell/en_IE
  C:/msys64/mingw64/share/hunspell/en_IN
  C:/msys64/mingw64/share/hunspell/en_JM
  C:/msys64/mingw64/share/hunspell/en_NA
  C:/msys64/mingw64/share/hunspell/en_NG
  C:/msys64/mingw64/share/hunspell/en_NZ
  C:/msys64/mingw64/share/hunspell/en_PH
  C:/msys64/mingw64/share/hunspell/en_SG
  C:/msys64/mingw64/share/hunspell/en_TT
  C:/msys64/mingw64/share/hunspell/en_US-large
  C:/msys64/mingw64/share/hunspell/en_US
  C:/msys64/mingw64/share/hunspell/en_ZA
  C:/msys64/mingw64/share/hunspell/en_ZW
  #+end_example

**  <2020-04-21 Tue> aspell 
   <2020-04-21 Tue> trying aspell
   pacman -S mingw64/mingw-w64-x86_64-aspell mingw64/mingw-w64-x86_64-aspell-en mingw64/mingw-w64-x86_64-aspell-es


   #+BEGIN_SRC sh
aspell dicts
   #+END_SRC

   #+RESULTS:
   #+begin_example
   el
   en
   en-variant_0
   en-variant_1
   en-variant_2
   en-w_accents
   en-wo_accents
   en_AU
   en_AU-variant_0
   en_AU-variant_1
   en_AU-w_accents
   en_AU-wo_accents
   en_CA
   en_CA-variant_0
   en_CA-variant_1
   en_CA-w_accents
   en_CA-wo_accents
   en_GB
   en_GB-ise
   en_GB-ise-w_accents
   en_GB-ise-wo_accents
   en_GB-ize
   en_GB-ize-w_accents
   en_GB-ize-wo_accents
   en_GB-variant_0
   en_GB-variant_1
   en_GB-w_accents
   en_GB-wo_accents
   en_US
   en_US-variant_0
   en_US-variant_1
   en_US-w_accents
   en_US-wo_accents
   es
   gr
   #+end_example

   #+BEGIN_SRC sh :results replace pp
echo dont | aspell -a
echo habia | aspell -l es -a
echo "γεια" | aspell -a -l el
   #+END_SRC

   #+RESULTS:

